## Pandas Excercises with  the chipottle data set.

Read data set and create a dataframe challed chipo.

In [10]:
import pandas as pd

In [11]:
chipo = pd.read_csv("chipotle.tsv", sep = "\t")

In [12]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [13]:
chipo.item_price.head()

0     $2.39
1     $3.39
2     $3.39
3     $2.39
4    $16.98
Name: item_price, dtype: object

In [19]:
#Let's convert item_price column to numeric.
chipo.item_price = chipo.item_price.str.strip()
chipo.item_price = chipo.item_price.str.strip("$")

In [20]:
chipo.item_price.head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: object

In [21]:
#let's convert item_price column to float.
chipo.item_price = chipo.item_price.astype(float)

In [22]:
chipo.item_price.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4622 entries, 0 to 4621
Series name: item_price
Non-Null Count  Dtype
--------------  -----
4622 non-null   float64
dtypes: float64(1)
memory usage: 36.2 KB

In [23]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

Let's create a new dataframe for items that cost more than 10$

In [29]:
chipo10 = chipo[chipo.item_price > 10]

In [30]:

len(chipo10)

1130

Let's calculate price per item.

In [31]:
chipo["price_per_item"] = chipo.item_price / chipo.quantity

In [33]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price,price_per_item
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,8.49

Let's check how many unique item_name we have

In [34]:
chipo.item_name.unique()

array(['Chips and Fresh Tomato Salsa', 'Izze', 'Nantucket Nectar',
       'Chips and Tomatillo-Green Chili Salsa', 'Chicken Bowl',
       'Side of Chips', 'Steak Burrito', 'Steak Soft Tacos',
       'Chips and Guacamole', 'Chicken Crispy Tacos',
       'Chicken Soft Tacos', 'Chicken Burrito', 'Canned Soda',
       'Barbacoa Burrito', 'Carnitas Burrito', 'Carnitas Bowl',
       'Bottled Water', 'Chips and Tomatillo Green Chili Salsa',
       'Barbacoa Bowl', 'Chips', 'Chicken Salad Bowl', 'Steak Bowl',
       'Barbacoa Soft Tacos', 'Veggie Burrito', 'Veggie Bowl',
       'Steak Crispy Tacos', 'Chips and Tomatillo Red Chili Salsa',
       'Barbacoa Crispy Tacos', 'Veggie Salad Bowl',
       'Chips and Roasted Chili-Corn Salsa',
       'Chips and Roasted Chili Corn Salsa', 'Carnitas Soft Tacos',
       'Chicken Salad', 'Canned Soft Drink', 'Steak Salad Bowl',
       '6 Pack Soft Drink', 'Chips and Tomatillo-Red Chili Salsa', 'Bowl',
       'Burrito', 'Crispy Tacos', 'Carnitas Crispy Tacos', 'Steak Salad',
       'Chips and Mild Fresh Tomato Salsa', 'Veggie Soft Tacos',
       'Carnitas Salad Bowl', 'Barbacoa Salad Bowl', 'Salad',
       'Veggie Crispy Tacos', 'Veggie Salad', 'Carnitas Salad'],
      dtype=object)

In [35]:
len(chipo.item_name.unique())

50

Let's delete the duplicates

In [41]:
chipo_unique_items = chipo.drop_duplicates("item_name")

In [42]:
chipo_unique_items.head()

,order_id,quantity,item_name,choice_description,item_price,price_per_item
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,8.49

Let's calculate the number of items that cost more than $10

In [45]:
(chipo_unique_items.price_per_item > 10).head()

0    False
1    False
2    False
3    False
4    False
Name: price_per_item, dtype: bool

In [48]:
(chipo_unique_items.price_per_item > 10).sum()

11

Let's sort the table by price per item column

In [49]:
chipo_sorted = chipo_unique_items.sort_values(by = "price_per_item", ascending = False)

In [52]:
chipo_sorted.head()

,order_id,quantity,item_name,choice_description,item_price,price_per_item
281,123,2,Steak Salad Bowl,"[Tomatillo Red Chili Salsa, [Black Beans, Chee...",23.78,11.89
1229,501,1,Barbacoa Salad Bowl,"[Fresh Tomato Salsa, [Rice, Fajita Vegetables,...",11.89,11.89
1132,468,1,Carnitas Salad Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",11.89,11.89
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.75,11.75
39,19,1,Barbacoa Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",11.75,11.75

Let's only get item names and their prices

In [72]:
chipo_price_list = chipo_sorted[["item_name", "price_per_item"]]

In [73]:
chipo_price_list.head()

                item_name  price_per_item
281      Steak Salad Bowl           11.89
1229  Barbacoa Salad Bowl           11.89
1132  Carnitas Salad Bowl           11.89
7           Steak Burrito           11.75
39          Barbacoa Bowl           11.75

Let's try reseting index and setting index

In [75]:
chipo_price_list.reset_index(drop = True).head()

             item_name  price_per_item
0     Steak Salad Bowl           11.89
1  Barbacoa Salad Bowl           11.89
2  Carnitas Salad Bowl           11.89
3        Steak Burrito           11.75
4        Barbacoa Bowl           11.75

In [76]:
chipo_price_list.set_index("item_name", inplace = True)

In [77]:
chipo_price_list.head()

                     price_per_item
item_name
Steak Salad Bowl              11.89
Barbacoa Salad Bowl           11.89
Carnitas Salad Bowl           11.89
Steak Burrito                 11.75
Barbacoa Bowl                 11.75

Let's get price of specific item.

In [79]:
chipo_price_list.loc["Steak Salad Bowl"]

price_per_item    11.89
Name: Steak Salad Bowl, dtype: float64

Let's see top-5 most expensive items

In [81]:
chipo_price_list.iloc[:5]

                     price_per_item
item_name
Steak Salad Bowl              11.89
Barbacoa Salad Bowl           11.89
Carnitas Salad Bowl           11.89
Steak Burrito                 11.75
Barbacoa Bowl                 11.75

Lets see How many times were a Veggie Salad Bowl ordered?

In [82]:
chipo_veggie_salad = chipo[chipo.item_name == "Veggie Salad Bowl"]

In [83]:
len(chipo_veggie_salad)

18

Let's see how many times people ordered more than one Canned Soda?

In [98]:
canned_soda_order = chipo[(chipo.item_name == "Canned Soda") & (chipo.quantity > 1)]

In [99]:
len(canned_soda_order)

20

Let's see how many times each item was ordered

In [105]:
chipo.item_name.value_counts().head()

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Steak Burrito          368
Canned Soft Drink      301
Name: count, dtype: int64

Let’s find out the total quantity of the chicken containing items.

In [110]:
def chicken_func(order):
    if "Chicken" in order:
        return 1
    else:
        return 0

In [111]:
chipo["chicken_check"] = chipo.item_name.map(chicken_func)

In [113]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price,price_per_item,chicken_check
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39,0
1,1,1,Izze,[Clementine],3.39,3.39,0
2,1,1,Nantucket Nectar,[Apple],3.39,3.39,0
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39,0
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,8.49,1

In [114]:
chipo["chicken_order_values"] = chipo.quantity * chipo.chicken_check

In [116]:
chipo.chicken_order_values.sum()

1654

Let's calculate total quantity for each item.

In [118]:
chipo.pivot_table(values = "quantity", index = "item_name", aggfunc = "sum")

                                       quantity
item_name
6 Pack Soft Drink                            55
Barbacoa Bowl                                66
Barbacoa Burrito                             91
Barbacoa Crispy Tacos                        12
Barbacoa Salad Bowl                          10
Barbacoa Soft Tacos                          25
Bottled Water                               211
Bowl                                          4
Burrito                                       6
Canned Soda                                 126
Canned Soft Drink                           351
Carnitas Bowl                                71
Carnitas Burrito                             60
Carnitas Crispy Tacos                         8
Carnitas Salad                                1
Carnitas Salad Bowl                           6
Carnitas Soft Tacos                          40
Chicken Bowl                                761
Chicken Burrito                             591
Chicken Crispy Tacos                         50
Chicken Salad                                 9
Chicken Salad Bowl                          123
Chicken Soft Tacos                          120
Chips                                       230
Chips and Fresh Tomato Salsa                130
Chips and Guacamole                         506
Chips and Mild Fresh Tomato Salsa             1
Chips and Roasted Chili Corn Salsa           23
Chips and Roasted Chili-Corn Salsa           18
Chips and Tomatillo Green Chili Salsa        45
Chips and Tomatillo Red Chili Salsa          50
Chips and Tomatillo-Green Chili Salsa        33
Chips and Tomatillo-Red Chili Salsa          25
Crispy Tacos                                  2
Izze                                         20
Nantucket Nectar                             29
Salad                                         2
Side of Chips                               110
Steak Bowl                                  221
Steak Burrito                               386
Steak Crispy Tacos                           36
Steak Salad                                   4
Steak Salad Bowl                             31
Steak Soft Tacos                             56
Veggie Bowl                                  87
Veggie Burrito                               97
Veggie Crispy Tacos                           1
Veggie Salad                                  6
Veggie Salad Bowl                            18
Veggie Soft Tacos                             8